azure/repind-ri-ws/api/CreateOrUpdateIndividualWS/v8/Regression Tests/CreateUpdate PNM/Create.bru

meta {
  name: Create
  type: http
  seq: 2
}

post {
  url: {{create-or-update-individual-v8-url}}
  body: xml
  auth: none
}

headers {
  SOAPAction: "http://www.af-klm.com/services/passenger/CreateUpdateIndividualService-v8/createIndividual"
}

body:xml {
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Body>
          <ns5:CreateUpdateIndividualRequestElement xmlns:ns6="http://www.af-klm.com/services/passenger/SicOsirisType-v1/xsd"
              xmlns:ns5="http://www.af-klm.com/services/passenger/data-v8/xsd"
              xmlns:ns8="http://www.af-klm.com/services/passenger/request-v8/xsd"
              xmlns:ns7="http://www.af-klm.com/services/passenger/SicCommonType-v1/xsd"
              xmlns:ns2="http://www.af-klm.com/services/passenger/response-v8/xsd"
              xmlns:ns4="http://www.af-klm.com/services/passenger/SoftComputingType-v1/xsd"
              xmlns:ns3="http://www.af-klm.com/services/passenger/SicIndividuType-v3/xsd">
              <requestor>
                  <channel>B2C</channel>
                  <site>QVI</site>
                  <signature>REGRESSION</signature>
              </requestor>
              <individualRequest>
                  <individualInformations>
                      <identifier>{{gin_create}}</identifier>
                  </individualInformations>
              </individualRequest>
              <externalIdentifierRequest>
                  <externalIdentifier>
                      <identifier>2C6A5DE9-F77D-4731-9C03-E25634E97144</identifier>
                      <type>PNM_ID</type>
                  </externalIdentifier>
                  <externalIdentifierData>
                      <key>APP_LANGUAGE_CODE</key>
                      <value>FR</value>
                  </externalIdentifierData>
                  <externalIdentifierData>
                      <key>APP_NAME</key>
                      <value> AFMOBILEIOSRCT</value>
                  </externalIdentifierData>
                  <externalIdentifierData>
                      <key>PNM_AIRLINE</key>
                      <value>AF</value>
                  </externalIdentifierData>
                  <externalIdentifierData>
                      <key>DEVICE_NAME</key>
                      <value>TOTO SAMSUNG</value>
                  </externalIdentifierData>
                  <externalIdentifierData>
                      <key>OPTIN</key>
                      <value>Y</value>
                  </externalIdentifierData>
                  <externalIdentifierData>
                      <key>USED_BY_AF</key>
                      <value>Y</value>
                  </externalIdentifierData>
              </externalIdentifierRequest>
          </ns5:CreateUpdateIndividualRequestElement>
      </soapenv:Body>
  </soapenv:Envelope>
}

vars:pre-request {
  USER: W90000442
  PASSWORD: pswpsw123
}

vars:post-response {
  gin_create: null
}

assert {
  res.status: eq 200
}
